[
  {
    "name": "Sun West Mortgage Company",
    "date": "October 2023 - Present",
    "logo": {
      "minUrl": "/assets/experiences/swmc-min.png",
      "url": "/assets/experiences/swmc.png",
      "alt": "swmc logo"
    },
    "description": "At Sun West Mortgage Company, Played a pivotal role in AngelAI's success, spearheading the chat-based loan application feature. Impacted 20M Superbowl users, achieving a remarkable 16x user growth. Engineered performance enhancements via code splitting and lazy loading, optimizing efficiency."
  },
  {
    "name": "Formation",
    "date": "Jan 2023 - Present",
    "logo": {
      "minUrl": "/assets/experiences/formation-min.png",
      "url": "/assets/experiences/formation.png",
      "alt": "formation logo"
    },
    "description": "Chosen for exclusive Fellowship providing individualized instruction from leading engineers. Leading a team of 6, we embarked on a unique project - building a Twitter-like platform using only emojis. This endeavor not only taught junior developers essential programming skills but also showcased my ability to effectively mentor and support peer learners. Additionally, I had the opportunity to collaborate with senior developers from renowned tech giants like Facebook and Google on complex tasks, further honing my collaboration skills."
  },
  {
    "name": "Thumbstopper",
    "date": "June 2021 - July 2022",
    "logo": {
      "minUrl": "/assets/experiences/thumbstopper-min.png",
      "url": "/assets/experiences/thumbstopper.png",
      "alt": "thumbstopper logo"
    },
    "description": "At Thumbstopper, I successfully integrated back-end services and server-side logic to create a high-performance platform. I also ensured smooth front-end integration and seamless integration of user-facing elements. Overcoming architectural challenges, I implemented the MVC design patterns and utilized PHP web frameworks to optimize the system's performance. Additionally, I employed front-end technologies like Vue.js and object-oriented PHP programming to enhance the user experience. Furthermore, I efficiently managed and accessed SQL databases to store and retrieve data."
  }
]
